Revit 2027 API
DisplacementElement.ParentId Property
 The element id of the parent DisplacementElement. This DisplacementElement's relative transform will be concatenated with the absolute transform of its parent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ParentId { get; }
Public ReadOnly Property ParentId As ElementId
	Get
public:
property ElementId^ ParentId {
	ElementId^ get ();
}
member ParentId : ElementId with get
Property Value
ElementId
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace